{
  "nodes": [
    {
      "op": "null", 
      "name": "data", 
      "inputs": []
    }, 
    {
      "op": "_copy", 
      "name": "id", 
      "inputs": [[0, 0, 0]]
    }, 
    {
      "op": "null", 
      "name": "bn_data_gamma", 
      "attrs": {
        "eps": "2e-05", 
        "fix_gamma": "True", 
        "momentum": "0.9"
      }, 
      "inputs": []
    }, 
    {
      "op": "null", 
      "name": "bn_data_beta", 
      "attrs": {
        "eps": "2e-05", 
        "fix_gamma": "True", 
        "momentum": "0.9"
      }, 
      "inputs": []
    }, 
    {
      "op": "null", 
      "name": "bn_data_moving_mean", 
      "attrs": {
        "__init__": "[\"zero\", {}]", 
        "eps": "2e-05", 
        "fix_gamma": "True", 
        "momentum": "0.9"
      }, 
      "inputs": []
    }, 
    {
      "op": "null", 
      "name": "bn_data_moving_var", 
      "attrs": {
        "__init__": "[\"one\", {}]", 
        "eps": "2e-05", 
        "fix_gamma": "True", 
        "momentum": "0.9"
      }, 
      "inputs": []
    }, 
    {
      "op": "BatchNorm", 
      "name": "bn_data", 
      "attrs": {
        "eps": "2e-05", 
        "fix_gamma": "True", 
        "momentum": "0.9"
      }, 
      "inputs": [[1, 0, 0], [2, 0, 0], [3, 0, 0], [4, 0, 1], [5, 0, 1]]
    }, 
    {
      "op": "null", 
      "name": "conv0_weight", 
      "attrs": {
        "kernel": "(7, 7)", 
        "no_bias": "True", 
        "num_filter": "64", 
        "pad": "(3, 3)", 
        "stride": "(2, 2)", 
        "workspace": "512"
      }, 
      "inputs": []
    }, 
    {
      "op": "Convolution", 
      "name": "conv0", 
      "attrs": {
        "kernel": "(7, 7)", 
        "no_bias": "True", 
        "num_filter": "64", 
        "pad": "(3, 3)", 
        "stride": "(2, 2)", 
        "workspace": "512"
      }, 
      "inputs": [[6, 0, 0], [7, 0, 0]]
    }, 
    {
      "op": "null", 
      "name": "bn0_gamma", 
      "attrs": {
        "eps": "1e-05", 
        "fix_gamma": "False", 
        "momentum": "0.9"
      }, 
      "inputs": []
    }, 
    {
      "op": "null", 
      "name": "bn0_beta", 
      "attrs": {
        "eps": "1e-05", 
        "fix_gamma": "False", 
        "momentum": "0.9"
      }, 
      "inputs": []
    }, 
    {
      "op": "null", 
      "name": "bn0_moving_mean", 
      "attrs": {
        "__init__": "[\"zero\", {}]", 
        "eps": "1e-05", 
        "fix_gamma": "False", 
        "momentum": "0.9"
      }, 
      "inputs": []
    }, 
    {
      "op": "null", 
      "name": "bn0_moving_var", 
      "attrs": {
        "__init__": "[\"one\", {}]", 
        "eps": "1e-05", 
        "fix_gamma": "False", 
        "momentum": "0.9"
      }, 
      "inputs": []
    }, 
    {
      "op": "BatchNorm", 
      "name": "bn0", 
      "attrs": {
        "eps": "1e-05", 
        "fix_gamma": "False", 
        "momentum": "0.9"
      }, 
      "inputs": [[8, 0, 0], [9, 0, 0], [10, 0, 0], [11, 0, 1], [12, 0, 1]]
    }, 
    {
      "op": "Activation", 
      "name": "relu0", 
      "attrs": {"act_type": "relu"}, 
      "inputs": [[13, 0, 0]]
    }, 
    {
      "op": "Pooling", 
      "name": "pooling0", 
      "attrs": {
        "kernel": "(3, 3)", 
        "pad": "(1, 1)", 
        "pool_type": "max", 
        "stride": "(2, 2)"
      }, 
      "inputs": [[14, 0, 0]]
    }, 
    {
      "op": "null", 
      "name": "stage1_unit1_bn1_gamma", 
      "attrs": {
        "eps": "1e-05", 
        "fix_gamma": "False", 
        "momentum": "0.9"
      }, 
      "inputs": []
    }, 
    {
      "op": "null", 
      "name": "stage1_unit1_bn1_beta", 
      "attrs": {
        "eps": "1e-05", 
        "fix_gamma": "False", 
        "momentum": "0.9"
      }, 
      "inputs": []
    }, 
    {
      "op": "null", 
      "name": "stage1_unit1_bn1_moving_mean", 
      "attrs": {
        "__init__": "[\"zero\", {}]", 
        "eps": "1e-05", 
        "fix_gamma": "False", 
        "momentum": "0.9"
      }, 
      "inputs": []
    }, 
    {
      "op": "null", 
      "name": "stage1_unit1_bn1_moving_var", 
      "attrs": {
        "__init__": "[\"one\", {}]", 
        "eps": "1e-05", 
        "fix_gamma": "False", 
        "momentum": "0.9"
      }, 
      "inputs": []
    }, 
    {
      "op": "BatchNorm", 
      "name": "stage1_unit1_bn1", 
      "attrs": {
        "eps": "1e-05", 
        "fix_gamma": "False", 
        "momentum": "0.9"
      }, 
      "inputs": [[15, 0, 0], [16, 0, 0], [17, 0, 0], [18, 0, 1], [19, 0, 1]]
    }, 
    {
      "op": "Activation", 
      "name": "stage1_unit1_relu1", 
      "attrs": {"act_type": "relu"}, 
      "inputs": [[20, 0, 0]]
    }, 
    {
      "op": "null", 
      "name": "stage1_unit1_conv1_weight", 
      "attrs": {
        "kernel": "(3, 3)", 
        "no_bias": "True", 
        "num_filter": "64", 
        "pad": "(1, 1)", 
        "stride": "(1, 1)", 
        "workspace": "512"
      }, 
      "inputs": []
    }, 
    {
      "op": "Convolution", 
      "name": "stage1_unit1_conv1", 
      "attrs": {
        "kernel": "(3, 3)", 
        "no_bias": "True", 
        "num_filter": "64", 
        "pad": "(1, 1)", 
        "stride": "(1, 1)", 
        "workspace": "512"
      }, 
      "inputs": [[21, 0, 0], [22, 0, 0]]
    }, 
    {
      "op": "null", 
      "name": "stage1_unit1_bn2_gamma", 
      "attrs": {
        "eps": "1e-05", 
        "fix_gamma": "False", 
        "momentum": "0.9"
      }, 
      "inputs": []
    }, 
    {
      "op": "null", 
      "name": "stage1_unit1_bn2_beta", 
      "attrs": {
        "eps": "1e-05", 
        "fix_gamma": "False", 
        "momentum": "0.9"
      }, 
      "inputs": []
    }, 
    {
      "op": "null", 
      "name": "stage1_unit1_bn2_moving_mean", 
      "attrs": {
        "__init__": "[\"zero\", {}]", 
        "eps": "1e-05", 
        "fix_gamma": "False", 
        "momentum": "0.9"
      }, 
      "inputs": []
    }, 
    {
      "op": "null", 
      "name": "stage1_unit1_bn2_moving_var", 
      "attrs": {
        "__init__": "[\"one\", {}]", 
        "eps": "1e-05", 
        "fix_gamma": "False", 
        "momentum": "0.9"
      }, 
      "inputs": []
    }, 
    {
      "op": "BatchNorm", 
      "name": "stage1_unit1_bn2", 
      "attrs": {
        "eps": "1e-05", 
        "fix_gamma": "False", 
        "momentum": "0.9"
      }, 
      "inputs": [[23, 0, 0], [24, 0, 0], [25, 0, 0], [26, 0, 1], [27, 0, 1]]
    }, 
    {
      "op": "Activation", 
      "name": "stage1_unit1_relu2", 
      "attrs": {"act_type": "relu"}, 
      "inputs": [[28, 0, 0]]
    }, 
    {
      "op": "null", 
      "name": "stage1_unit1_conv2_weight", 
      "attrs": {
        "kernel": "(3, 3)", 
        "no_bias": "True", 
        "num_filter": "64", 
        "pad": "(1, 1)", 
        "stride": "(1, 1)", 
        "workspace": "512"
      }, 
      "inputs": []
    }, 
    {
      "op": "Convolution", 
      "name": "stage1_unit1_conv2", 
      "attrs": {
        "kernel": "(3, 3)", 
        "no_bias": "True", 
        "num_filter": "64", 
        "pad": "(1, 1)", 
        "stride": "(1, 1)", 
        "workspace": "512"
      }, 
      "inputs": [[29, 0, 0], [30, 0, 0]]
    }, 
    {
      "op": "null", 
      "name": "stage1_unit1_sc_weight", 
      "attrs": {
        "kernel": "(1, 1)", 
        "no_bias": "True", 
        "num_filter": "64", 
        "stride": "(1, 1)", 
        "workspace": "512"
      }, 
      "inputs": []
    }, 
    {
      "op": "Convolution", 
      "name": "stage1_unit1_sc", 
      "attrs": {
        "kernel": "(1, 1)", 
        "no_bias": "True", 
        "num_filter": "64", 
        "stride": "(1, 1)", 
        "workspace": "512"
      }, 
      "inputs": [[21, 0, 0], [32, 0, 0]]
    }, 
    {
      "op": "elemwise_add", 
      "name": "_plus0", 
      "inputs": [[31, 0, 0], [33, 0, 0]]
    }, 
    {
      "op": "null", 
      "name": "stage1_unit2_bn1_gamma", 
      "attrs": {
        "eps": "1e-05", 
        "fix_gamma": "False", 
        "momentum": "0.9"
      }, 
      "inputs": []
    }, 
    {
      "op": "null", 
      "name": "stage1_unit2_bn1_beta", 
      "attrs": {
        "eps": "1e-05", 
        "fix_gamma": "False", 
        "momentum": "0.9"
      }, 
      "inputs": []
    }, 
    {
      "op": "null", 
      "name": "stage1_unit2_bn1_moving_mean", 
      "attrs": {
        "__init__": "[\"zero\", {}]", 
        "eps": "1e-05", 
        "fix_gamma": "False", 
        "momentum": "0.9"
      }, 
      "inputs": []
    }, 
    {
      "op": "null", 
      "name": "stage1_unit2_bn1_moving_var", 
      "attrs": {
        "__init__": "[\"one\", {}]", 
        "eps": "1e-05", 
        "fix_gamma": "False", 
        "momentum": "0.9"
      }, 
      "inputs": []
    }, 
    {
      "op": "BatchNorm", 
      "name": "stage1_unit2_bn1", 
      "attrs": {
        "eps": "1e-05", 
        "fix_gamma": "False", 
        "momentum": "0.9"
      }, 
      "inputs": [[34, 0, 0], [35, 0, 0], [36, 0, 0], [37, 0, 1], [38, 0, 1]]
    }, 
    {
      "op": "Activation", 
      "name": "stage1_unit2_relu1", 
      "attrs": {"act_type": "relu"}, 
      "inputs": [[39, 0, 0]]
    }, 
    {
      "op": "null", 
      "name": "stage1_unit2_conv1_weight", 
      "attrs": {
        "kernel": "(3, 3)", 
        "no_bias": "True", 
        "num_filter": "64", 
        "pad": "(1, 1)", 
        "stride": "(1, 1)", 
        "workspace": "512"
      }, 
      "inputs": []
    }, 
    {
      "op": "Convolution", 
      "name": "stage1_unit2_conv1", 
      "attrs": {
        "kernel": "(3, 3)", 
        "no_bias": "True", 
        "num_filter": "64", 
        "pad": "(1, 1)", 
        "stride": "(1, 1)", 
        "workspace": "512"
      }, 
      "inputs": [[40, 0, 0], [41, 0, 0]]
    }, 
    {
      "op": "null", 
      "name": "stage1_unit2_bn2_gamma", 
      "attrs": {
        "eps": "1e-05", 
        "fix_gamma": "False", 
        "momentum": "0.9"
      }, 
      "inputs": []
    }, 
    {
      "op": "null", 
      "name": "stage1_unit2_bn2_beta", 
      "attrs": {
        "eps": "1e-05", 
        "fix_gamma": "False", 
        "momentum": "0.9"
      }, 
      "inputs": []
    }, 
    {
      "op": "null", 
      "name": "stage1_unit2_bn2_moving_mean", 
      "attrs": {
        "__init__": "[\"zero\", {}]", 
        "eps": "1e-05", 
        "fix_gamma": "False", 
        "momentum": "0.9"
      }, 
      "inputs": []
    }, 
    {
      "op": "null", 
      "name": "stage1_unit2_bn2_moving_var", 
      "attrs": {
        "__init__": "[\"one\", {}]", 
        "eps": "1e-05", 
        "fix_gamma": "False", 
        "momentum": "0.9"
      }, 
      "inputs": []
    }, 
    {
      "op": "BatchNorm", 
      "name": "stage1_unit2_bn2", 
      "attrs": {
        "eps": "1e-05", 
        "fix_gamma": "False", 
        "momentum": "0.9"
      }, 
      "inputs": [[42, 0, 0], [43, 0, 0], [44, 0, 0], [45, 0, 1], [46, 0, 1]]
    }, 
    {
      "op": "Activation", 
      "name": "stage1_unit2_relu2", 
      "attrs": {"act_type": "relu"}, 
      "inputs": [[47, 0, 0]]
    }, 
    {
      "op": "null", 
      "name": "stage1_unit2_conv2_weight", 
      "attrs": {
        "kernel": "(3, 3)", 
        "no_bias": "True", 
        "num_filter": "64", 
        "pad": "(1, 1)", 
        "stride": "(1, 1)", 
        "workspace": "512"
      }, 
      "inputs": []
    }, 
    {
      "op": "Convolution", 
      "name": "stage1_unit2_conv2", 
      "attrs": {
        "kernel": "(3, 3)", 
        "no_bias": "True", 
        "num_filter": "64", 
        "pad": "(1, 1)", 
        "stride": "(1, 1)", 
        "workspace": "512"
      }, 
      "inputs": [[48, 0, 0], [49, 0, 0]]
    }, 
    {
      "op": "elemwise_add", 
      "name": "_plus1", 
      "inputs": [[50, 0, 0], [34, 0, 0]]
    }, 
    {
      "op": "null", 
      "name": "stage2_unit1_bn1_gamma", 
      "attrs": {
        "eps": "1e-05", 
        "fix_gamma": "False", 
        "momentum": "0.9"
      }, 
      "inputs": []
    }, 
    {
      "op": "null", 
      "name": "stage2_unit1_bn1_beta", 
      "attrs": {
        "eps": "1e-05", 
        "fix_gamma": "False", 
        "momentum": "0.9"
      }, 
      "inputs": []
    }, 
    {
      "op": "null", 
      "name": "stage2_unit1_bn1_moving_mean", 
      "attrs": {
        "__init__": "[\"zero\", {}]", 
        "eps": "1e-05", 
        "fix_gamma": "False", 
        "momentum": "0.9"
      }, 
      "inputs": []
    }, 
    {
      "op": "null", 
      "name": "stage2_unit1_bn1_moving_var", 
      "attrs": {
        "__init__": "[\"one\", {}]", 
        "eps": "1e-05", 
        "fix_gamma": "False", 
        "momentum": "0.9"
      }, 
      "inputs": []
    }, 
    {
      "op": "BatchNorm", 
      "name": "stage2_unit1_bn1", 
      "attrs": {
        "eps": "1e-05", 
        "fix_gamma": "False", 
        "momentum": "0.9"
      }, 
      "inputs": [[51, 0, 0], [52, 0, 0], [53, 0, 0], [54, 0, 1], [55, 0, 1]]
    }, 
    {
      "op": "Activation", 
      "name": "stage2_unit1_relu1", 
      "attrs": {"act_type": "relu"}, 
      "inputs": [[56, 0, 0]]
    }, 
    {
      "op": "null", 
      "name": "stage2_unit1_conv1_weight", 
      "attrs": {
        "kernel": "(3, 3)", 
        "no_bias": "True", 
        "num_filter": "128", 
        "pad": "(1, 1)", 
        "stride": "(2, 2)", 
        "workspace": "512"
      }, 
      "inputs": []
    }, 
    {
      "op": "Convolution", 
      "name": "stage2_unit1_conv1", 
      "attrs": {
        "kernel": "(3, 3)", 
        "no_bias": "True", 
        "num_filter": "128", 
        "pad": "(1, 1)", 
        "stride": "(2, 2)", 
        "workspace": "512"
      }, 
      "inputs": [[57, 0, 0], [58, 0, 0]]
    }, 
    {
      "op": "null", 
      "name": "stage2_unit1_bn2_gamma", 
      "attrs": {
        "eps": "1e-05", 
        "fix_gamma": "False", 
        "momentum": "0.9"
      }, 
      "inputs": []
    }, 
    {
      "op": "null", 
      "name": "stage2_unit1_bn2_beta", 
      "attrs": {
        "eps": "1e-05", 
        "fix_gamma": "False", 
        "momentum": "0.9"
      }, 
      "inputs": []
    }, 
    {
      "op": "null", 
      "name": "stage2_unit1_bn2_moving_mean", 
      "attrs": {
        "__init__": "[\"zero\", {}]", 
        "eps": "1e-05", 
        "fix_gamma": "False", 
        "momentum": "0.9"
      }, 
      "inputs": []
    }, 
    {
      "op": "null", 
      "name": "stage2_unit1_bn2_moving_var", 
      "attrs": {
        "__init__": "[\"one\", {}]", 
        "eps": "1e-05", 
        "fix_gamma": "False", 
        "momentum": "0.9"
      }, 
      "inputs": []
    }, 
    {
      "op": "BatchNorm", 
      "name": "stage2_unit1_bn2", 
      "attrs": {
        "eps": "1e-05", 
        "fix_gamma": "False", 
        "momentum": "0.9"
      }, 
      "inputs": [[59, 0, 0], [60, 0, 0], [61, 0, 0], [62, 0, 1], [63, 0, 1]]
    }, 
    {
      "op": "Activation", 
      "name": "stage2_unit1_relu2", 
      "attrs": {"act_type": "relu"}, 
      "inputs": [[64, 0, 0]]
    }, 
    {
      "op": "null", 
      "name": "stage2_unit1_conv2_weight", 
      "attrs": {
        "kernel": "(3, 3)", 
        "no_bias": "True", 
        "num_filter": "128", 
        "pad": "(1, 1)", 
        "stride": "(1, 1)", 
        "workspace": "512"
      }, 
      "inputs": []
    }, 
    {
      "op": "Convolution", 
      "name": "stage2_unit1_conv2", 
      "attrs": {
        "kernel": "(3, 3)", 
        "no_bias": "True", 
        "num_filter": "128", 
        "pad": "(1, 1)", 
        "stride": "(1, 1)", 
        "workspace": "512"
      }, 
      "inputs": [[65, 0, 0], [66, 0, 0]]
    }, 
    {
      "op": "null", 
      "name": "stage2_unit1_sc_weight", 
      "attrs": {
        "kernel": "(1, 1)", 
        "no_bias": "True", 
        "num_filter": "128", 
        "stride": "(2, 2)", 
        "workspace": "512"
      }, 
      "inputs": []
    }, 
    {
      "op": "Convolution", 
      "name": "stage2_unit1_sc", 
      "attrs": {
        "kernel": "(1, 1)", 
        "no_bias": "True", 
        "num_filter": "128", 
        "stride": "(2, 2)", 
        "workspace": "512"
      }, 
      "inputs": [[57, 0, 0], [68, 0, 0]]
    }, 
    {
      "op": "elemwise_add", 
      "name": "_plus2", 
      "inputs": [[67, 0, 0], [69, 0, 0]]
    }, 
    {
      "op": "null", 
      "name": "stage2_unit2_bn1_gamma", 
      "attrs": {
        "eps": "1e-05", 
        "fix_gamma": "False", 
        "momentum": "0.9"
      }, 
      "inputs": []
    }, 
    {
      "op": "null", 
      "name": "stage2_unit2_bn1_beta", 
      "attrs": {
        "eps": "1e-05", 
        "fix_gamma": "False", 
        "momentum": "0.9"
      }, 
      "inputs": []
    }, 
    {
      "op": "null", 
      "name": "stage2_unit2_bn1_moving_mean", 
      "attrs": {
        "__init__": "[\"zero\", {}]", 
        "eps": "1e-05", 
        "fix_gamma": "False", 
        "momentum": "0.9"
      }, 
      "inputs": []
    }, 
    {
      "op": "null", 
      "name": "stage2_unit2_bn1_moving_var", 
      "attrs": {
        "__init__": "[\"one\", {}]", 
        "eps": "1e-05", 
        "fix_gamma": "False", 
        "momentum": "0.9"
      }, 
      "inputs": []
    }, 
    {
      "op": "BatchNorm", 
      "name": "stage2_unit2_bn1", 
      "attrs": {
        "eps": "1e-05", 
        "fix_gamma": "False", 
        "momentum": "0.9"
      }, 
      "inputs": [[70, 0, 0], [71, 0, 0], [72, 0, 0], [73, 0, 1], [74, 0, 1]]
    }, 
    {
      "op": "Activation", 
      "name": "stage2_unit2_relu1", 
      "attrs": {"act_type": "relu"}, 
      "inputs": [[75, 0, 0]]
    }, 
    {
      "op": "null", 
      "name": "stage2_unit2_conv1_weight", 
      "attrs": {
        "kernel": "(3, 3)", 
        "no_bias": "True", 
        "num_filter": "128", 
        "pad": "(1, 1)", 
        "stride": "(1, 1)", 
        "workspace": "512"
      }, 
      "inputs": []
    }, 
    {
      "op": "Convolution", 
      "name": "stage2_unit2_conv1", 
      "attrs": {
        "kernel": "(3, 3)", 
        "no_bias": "True", 
        "num_filter": "128", 
        "pad": "(1, 1)", 
        "stride": "(1, 1)", 
        "workspace": "512"
      }, 
      "inputs": [[76, 0, 0], [77, 0, 0]]
    }, 
    {
      "op": "null", 
      "name": "stage2_unit2_bn2_gamma", 
      "attrs": {
        "eps": "1e-05", 
        "fix_gamma": "False", 
        "momentum": "0.9"
      }, 
      "inputs": []
    }, 
    {
      "op": "null", 
      "name": "stage2_unit2_bn2_beta", 
      "attrs": {
        "eps": "1e-05", 
        "fix_gamma": "False", 
        "momentum": "0.9"
      }, 
      "inputs": []
    }, 
    {
      "op": "null", 
      "name": "stage2_unit2_bn2_moving_mean", 
      "attrs": {
        "__init__": "[\"zero\", {}]", 
        "eps": "1e-05", 
        "fix_gamma": "False", 
        "momentum": "0.9"
      }, 
      "inputs": []
    }, 
    {
      "op": "null", 
      "name": "stage2_unit2_bn2_moving_var", 
      "attrs": {
        "__init__": "[\"one\", {}]", 
        "eps": "1e-05", 
        "fix_gamma": "False", 
        "momentum": "0.9"
      }, 
      "inputs": []
    }, 
    {
      "op": "BatchNorm", 
      "name": "stage2_unit2_bn2", 
      "attrs": {
        "eps": "1e-05", 
        "fix_gamma": "False", 
        "momentum": "0.9"
      }, 
      "inputs": [[78, 0, 0], [79, 0, 0], [80, 0, 0], [81, 0, 1], [82, 0, 1]]
    }, 
    {
      "op": "Activation", 
      "name": "stage2_unit2_relu2", 
      "attrs": {"act_type": "relu"}, 
      "inputs": [[83, 0, 0]]
    }, 
    {
      "op": "null", 
      "name": "stage2_unit2_conv2_weight", 
      "attrs": {
        "kernel": "(3, 3)", 
        "no_bias": "True", 
        "num_filter": "128", 
        "pad": "(1, 1)", 
        "stride": "(1, 1)", 
        "workspace": "512"
      }, 
      "inputs": []
    }, 
    {
      "op": "Convolution", 
      "name": "stage2_unit2_conv2", 
      "attrs": {
        "kernel": "(3, 3)", 
        "no_bias": "True", 
        "num_filter": "128", 
        "pad": "(1, 1)", 
        "stride": "(1, 1)", 
        "workspace": "512"
      }, 
      "inputs": [[84, 0, 0], [85, 0, 0]]
    }, 
    {
      "op": "elemwise_add", 
      "name": "_plus3", 
      "inputs": [[86, 0, 0], [70, 0, 0]]
    }, 
    {
      "op": "null", 
      "name": "stage3_unit1_bn1_gamma", 
      "attrs": {
        "eps": "1e-05", 
        "fix_gamma": "False", 
        "momentum": "0.9"
      }, 
      "inputs": []
    }, 
    {
      "op": "null", 
      "name": "stage3_unit1_bn1_beta", 
      "attrs": {
        "eps": "1e-05", 
        "fix_gamma": "False", 
        "momentum": "0.9"
      }, 
      "inputs": []
    }, 
    {
      "op": "null", 
      "name": "stage3_unit1_bn1_moving_mean", 
      "attrs": {
        "__init__": "[\"zero\", {}]", 
        "eps": "1e-05", 
        "fix_gamma": "False", 
        "momentum": "0.9"
      }, 
      "inputs": []
    }, 
    {
      "op": "null", 
      "name": "stage3_unit1_bn1_moving_var", 
      "attrs": {
        "__init__": "[\"one\", {}]", 
        "eps": "1e-05", 
        "fix_gamma": "False", 
        "momentum": "0.9"
      }, 
      "inputs": []
    }, 
    {
      "op": "BatchNorm", 
      "name": "stage3_unit1_bn1", 
      "attrs": {
        "eps": "1e-05", 
        "fix_gamma": "False", 
        "momentum": "0.9"
      }, 
      "inputs": [[87, 0, 0], [88, 0, 0], [89, 0, 0], [90, 0, 1], [91, 0, 1]]
    }, 
    {
      "op": "Activation", 
      "name": "stage3_unit1_relu1", 
      "attrs": {"act_type": "relu"}, 
      "inputs": [[92, 0, 0]]
    }, 
    {
      "op": "null", 
      "name": "stage3_unit1_conv1_weight", 
      "attrs": {
        "kernel": "(3, 3)", 
        "no_bias": "True", 
        "num_filter": "256", 
        "pad": "(1, 1)", 
        "stride": "(2, 2)", 
        "workspace": "512"
      }, 
      "inputs": []
    }, 
    {
      "op": "Convolution", 
      "name": "stage3_unit1_conv1", 
      "attrs": {
        "kernel": "(3, 3)", 
        "no_bias": "True", 
        "num_filter": "256", 
        "pad": "(1, 1)", 
        "stride": "(2, 2)", 
        "workspace": "512"
      }, 
      "inputs": [[93, 0, 0], [94, 0, 0]]
    }, 
    {
      "op": "null", 
      "name": "stage3_unit1_bn2_gamma", 
      "attrs": {
        "eps": "1e-05", 
        "fix_gamma": "False", 
        "momentum": "0.9"
      }, 
      "inputs": []
    }, 
    {
      "op": "null", 
      "name": "stage3_unit1_bn2_beta", 
      "attrs": {
        "eps": "1e-05", 
        "fix_gamma": "False", 
        "momentum": "0.9"
      }, 
      "inputs": []
    }, 
    {
      "op": "null", 
      "name": "stage3_unit1_bn2_moving_mean", 
      "attrs": {
        "__init__": "[\"zero\", {}]", 
        "eps": "1e-05", 
        "fix_gamma": "False", 
        "momentum": "0.9"
      }, 
      "inputs": []
    }, 
    {
      "op": "null", 
      "name": "stage3_unit1_bn2_moving_var", 
      "attrs": {
        "__init__": "[\"one\", {}]", 
        "eps": "1e-05", 
        "fix_gamma": "False", 
        "momentum": "0.9"
      }, 
      "inputs": []
    }, 
    {
      "op": "BatchNorm", 
      "name": "stage3_unit1_bn2", 
      "attrs": {
        "eps": "1e-05", 
        "fix_gamma": "False", 
        "momentum": "0.9"
      }, 
      "inputs": [[95, 0, 0], [96, 0, 0], [97, 0, 0], [98, 0, 1], [99, 0, 1]]
    }, 
    {
      "op": "Activation", 
      "name": "stage3_unit1_relu2", 
      "attrs": {"act_type": "relu"}, 
      "inputs": [[100, 0, 0]]
    }, 
    {
      "op": "null", 
      "name": "stage3_unit1_conv2_weight", 
      "attrs": {
        "kernel": "(3, 3)", 
        "no_bias": "True", 
        "num_filter": "256", 
        "pad": "(1, 1)", 
        "stride": "(1, 1)", 
        "workspace": "512"
      }, 
      "inputs": []
    }, 
    {
      "op": "Convolution", 
      "name": "stage3_unit1_conv2", 
      "attrs": {
        "kernel": "(3, 3)", 
        "no_bias": "True", 
        "num_filter": "256", 
        "pad": "(1, 1)", 
        "stride": "(1, 1)", 
        "workspace": "512"
      }, 
      "inputs": [[101, 0, 0], [102, 0, 0]]
    }, 
    {
      "op": "null", 
      "name": "stage3_unit1_sc_weight", 
      "attrs": {
        "kernel": "(1, 1)", 
        "no_bias": "True", 
        "num_filter": "256", 
        "stride": "(2, 2)", 
        "workspace": "512"
      }, 
      "inputs": []
    }, 
    {
      "op": "Convolution", 
      "name": "stage3_unit1_sc", 
      "attrs": {
        "kernel": "(1, 1)", 
        "no_bias": "True", 
        "num_filter": "256", 
        "stride": "(2, 2)", 
        "workspace": "512"
      }, 
      "inputs": [[93, 0, 0], [104, 0, 0]]
    }, 
    {
      "op": "elemwise_add", 
      "name": "_plus4", 
      "inputs": [[103, 0, 0], [105, 0, 0]]
    }, 
    {
      "op": "null", 
      "name": "stage3_unit2_bn1_gamma", 
      "attrs": {
        "eps": "1e-05", 
        "fix_gamma": "False", 
        "momentum": "0.9"
      }, 
      "inputs": []
    }, 
    {
      "op": "null", 
      "name": "stage3_unit2_bn1_beta", 
      "attrs": {
        "eps": "1e-05", 
        "fix_gamma": "False", 
        "momentum": "0.9"
      }, 
      "inputs": []
    }, 
    {
      "op": "null", 
      "name": "stage3_unit2_bn1_moving_mean", 
      "attrs": {
        "__init__": "[\"zero\", {}]", 
        "eps": "1e-05", 
        "fix_gamma": "False", 
        "momentum": "0.9"
      }, 
      "inputs": []
    }, 
    {
      "op": "null", 
      "name": "stage3_unit2_bn1_moving_var", 
      "attrs": {
        "__init__": "[\"one\", {}]", 
        "eps": "1e-05", 
        "fix_gamma": "False", 
        "momentum": "0.9"
      }, 
      "inputs": []
    }, 
    {
      "op": "BatchNorm", 
      "name": "stage3_unit2_bn1", 
      "attrs": {
        "eps": "1e-05", 
        "fix_gamma": "False", 
        "momentum": "0.9"
      }, 
      "inputs": [[106, 0, 0], [107, 0, 0], [108, 0, 0], [109, 0, 1], [110, 0, 1]]
    }, 
    {
      "op": "Activation", 
      "name": "stage3_unit2_relu1", 
      "attrs": {"act_type": "relu"}, 
      "inputs": [[111, 0, 0]]
    }, 
    {
      "op": "null", 
      "name": "stage3_unit2_conv1_weight", 
      "attrs": {
        "kernel": "(3, 3)", 
        "no_bias": "True", 
        "num_filter": "256", 
        "pad": "(1, 1)", 
        "stride": "(1, 1)", 
        "workspace": "512"
      }, 
      "inputs": []
    }, 
    {
      "op": "Convolution", 
      "name": "stage3_unit2_conv1", 
      "attrs": {
        "kernel": "(3, 3)", 
        "no_bias": "True", 
        "num_filter": "256", 
        "pad": "(1, 1)", 
        "stride": "(1, 1)", 
        "workspace": "512"
      }, 
      "inputs": [[112, 0, 0], [113, 0, 0]]
    }, 
    {
      "op": "null", 
      "name": "stage3_unit2_bn2_gamma", 
      "attrs": {
        "eps": "1e-05", 
        "fix_gamma": "False", 
        "momentum": "0.9"
      }, 
      "inputs": []
    }, 
    {
      "op": "null", 
      "name": "stage3_unit2_bn2_beta", 
      "attrs": {
        "eps": "1e-05", 
        "fix_gamma": "False", 
        "momentum": "0.9"
      }, 
      "inputs": []
    }, 
    {
      "op": "null", 
      "name": "stage3_unit2_bn2_moving_mean", 
      "attrs": {
        "__init__": "[\"zero\", {}]", 
        "eps": "1e-05", 
        "fix_gamma": "False", 
        "momentum": "0.9"
      }, 
      "inputs": []
    }, 
    {
      "op": "null", 
      "name": "stage3_unit2_bn2_moving_var", 
      "attrs": {
        "__init__": "[\"one\", {}]", 
        "eps": "1e-05", 
        "fix_gamma": "False", 
        "momentum": "0.9"
      }, 
      "inputs": []
    }, 
    {
      "op": "BatchNorm", 
      "name": "stage3_unit2_bn2", 
      "attrs": {
        "eps": "1e-05", 
        "fix_gamma": "False", 
        "momentum": "0.9"
      }, 
      "inputs": [[114, 0, 0], [115, 0, 0], [116, 0, 0], [117, 0, 1], [118, 0, 1]]
    }, 
    {
      "op": "Activation", 
      "name": "stage3_unit2_relu2", 
      "attrs": {"act_type": "relu"}, 
      "inputs": [[119, 0, 0]]
    }, 
    {
      "op": "null", 
      "name": "stage3_unit2_conv2_weight", 
      "attrs": {
        "kernel": "(3, 3)", 
        "no_bias": "True", 
        "num_filter": "256", 
        "pad": "(1, 1)", 
        "stride": "(1, 1)", 
        "workspace": "512"
      }, 
      "inputs": []
    }, 
    {
      "op": "Convolution", 
      "name": "stage3_unit2_conv2", 
      "attrs": {
        "kernel": "(3, 3)", 
        "no_bias": "True", 
        "num_filter": "256", 
        "pad": "(1, 1)", 
        "stride": "(1, 1)", 
        "workspace": "512"
      }, 
      "inputs": [[120, 0, 0], [121, 0, 0]]
    }, 
    {
      "op": "elemwise_add", 
      "name": "_plus5", 
      "inputs": [[122, 0, 0], [106, 0, 0]]
    }, 
    {
      "op": "null", 
      "name": "stage4_unit1_bn1_gamma", 
      "attrs": {
        "eps": "1e-05", 
        "fix_gamma": "False", 
        "momentum": "0.9"
      }, 
      "inputs": []
    }, 
    {
      "op": "null", 
      "name": "stage4_unit1_bn1_beta", 
      "attrs": {
        "eps": "1e-05", 
        "fix_gamma": "False", 
        "momentum": "0.9"
      }, 
      "inputs": []
    }, 
    {
      "op": "null", 
      "name": "stage4_unit1_bn1_moving_mean", 
      "attrs": {
        "__init__": "[\"zero\", {}]", 
        "eps": "1e-05", 
        "fix_gamma": "False", 
        "momentum": "0.9"
      }, 
      "inputs": []
    }, 
    {
      "op": "null", 
      "name": "stage4_unit1_bn1_moving_var", 
      "attrs": {
        "__init__": "[\"one\", {}]", 
        "eps": "1e-05", 
        "fix_gamma": "False", 
        "momentum": "0.9"
      }, 
      "inputs": []
    }, 
    {
      "op": "BatchNorm", 
      "name": "stage4_unit1_bn1", 
      "attrs": {
        "eps": "1e-05", 
        "fix_gamma": "False", 
        "momentum": "0.9"
      }, 
      "inputs": [[123, 0, 0], [124, 0, 0], [125, 0, 0], [126, 0, 1], [127, 0, 1]]
    }, 
    {
      "op": "Activation", 
      "name": "stage4_unit1_relu1", 
      "attrs": {"act_type": "relu"}, 
      "inputs": [[128, 0, 0]]
    }, 
    {
      "op": "null", 
      "name": "stage4_unit1_conv1_weight", 
      "attrs": {
        "kernel": "(3, 3)", 
        "no_bias": "True", 
        "num_filter": "512", 
        "pad": "(1, 1)", 
        "stride": "(2, 2)", 
        "workspace": "512"
      }, 
      "inputs": []
    }, 
    {
      "op": "Convolution", 
      "name": "stage4_unit1_conv1", 
      "attrs": {
        "kernel": "(3, 3)", 
        "no_bias": "True", 
        "num_filter": "512", 
        "pad": "(1, 1)", 
        "stride": "(2, 2)", 
        "workspace": "512"
      }, 
      "inputs": [[129, 0, 0], [130, 0, 0]]
    }, 
    {
      "op": "null", 
      "name": "stage4_unit1_bn2_gamma", 
      "attrs": {
        "eps": "1e-05", 
        "fix_gamma": "False", 
        "momentum": "0.9"
      }, 
      "inputs": []
    }, 
    {
      "op": "null", 
      "name": "stage4_unit1_bn2_beta", 
      "attrs": {
        "eps": "1e-05", 
        "fix_gamma": "False", 
        "momentum": "0.9"
      }, 
      "inputs": []
    }, 
    {
      "op": "null", 
      "name": "stage4_unit1_bn2_moving_mean", 
      "attrs": {
        "__init__": "[\"zero\", {}]", 
        "eps": "1e-05", 
        "fix_gamma": "False", 
        "momentum": "0.9"
      }, 
      "inputs": []
    }, 
    {
      "op": "null", 
      "name": "stage4_unit1_bn2_moving_var", 
      "attrs": {
        "__init__": "[\"one\", {}]", 
        "eps": "1e-05", 
        "fix_gamma": "False", 
        "momentum": "0.9"
      }, 
      "inputs": []
    }, 
    {
      "op": "BatchNorm", 
      "name": "stage4_unit1_bn2", 
      "attrs": {
        "eps": "1e-05", 
        "fix_gamma": "False", 
        "momentum": "0.9"
      }, 
      "inputs": [[131, 0, 0], [132, 0, 0], [133, 0, 0], [134, 0, 1], [135, 0, 1]]
    }, 
    {
      "op": "Activation", 
      "name": "stage4_unit1_relu2", 
      "attrs": {"act_type": "relu"}, 
      "inputs": [[136, 0, 0]]
    }, 
    {
      "op": "null", 
      "name": "stage4_unit1_conv2_weight", 
      "attrs": {
        "kernel": "(3, 3)", 
        "no_bias": "True", 
        "num_filter": "512", 
        "pad": "(1, 1)", 
        "stride": "(1, 1)", 
        "workspace": "512"
      }, 
      "inputs": []
    }, 
    {
      "op": "Convolution", 
      "name": "stage4_unit1_conv2", 
      "attrs": {
        "kernel": "(3, 3)", 
        "no_bias": "True", 
        "num_filter": "512", 
        "pad": "(1, 1)", 
        "stride": "(1, 1)", 
        "workspace": "512"
      }, 
      "inputs": [[137, 0, 0], [138, 0, 0]]
    }, 
    {
      "op": "null", 
      "name": "stage4_unit1_sc_weight", 
      "attrs": {
        "kernel": "(1, 1)", 
        "no_bias": "True", 
        "num_filter": "512", 
        "stride": "(2, 2)", 
        "workspace": "512"
      }, 
      "inputs": []
    }, 
    {
      "op": "Convolution", 
      "name": "stage4_unit1_sc", 
      "attrs": {
        "kernel": "(1, 1)", 
        "no_bias": "True", 
        "num_filter": "512", 
        "stride": "(2, 2)", 
        "workspace": "512"
      }, 
      "inputs": [[129, 0, 0], [140, 0, 0]]
    }, 
    {
      "op": "elemwise_add", 
      "name": "_plus6", 
      "inputs": [[139, 0, 0], [141, 0, 0]]
    }, 
    {
      "op": "null", 
      "name": "stage4_unit2_bn1_gamma", 
      "attrs": {
        "eps": "1e-05", 
        "fix_gamma": "False", 
        "momentum": "0.9"
      }, 
      "inputs": []
    }, 
    {
      "op": "null", 
      "name": "stage4_unit2_bn1_beta", 
      "attrs": {
        "eps": "1e-05", 
        "fix_gamma": "False", 
        "momentum": "0.9"
      }, 
      "inputs": []
    }, 
    {
      "op": "null", 
      "name": "stage4_unit2_bn1_moving_mean", 
      "attrs": {
        "__init__": "[\"zero\", {}]", 
        "eps": "1e-05", 
        "fix_gamma": "False", 
        "momentum": "0.9"
      }, 
      "inputs": []
    }, 
    {
      "op": "null", 
      "name": "stage4_unit2_bn1_moving_var", 
      "attrs": {
        "__init__": "[\"one\", {}]", 
        "eps": "1e-05", 
        "fix_gamma": "False", 
        "momentum": "0.9"
      }, 
      "inputs": []
    }, 
    {
      "op": "BatchNorm", 
      "name": "stage4_unit2_bn1", 
      "attrs": {
        "eps": "1e-05", 
        "fix_gamma": "False", 
        "momentum": "0.9"
      }, 
      "inputs": [[142, 0, 0], [143, 0, 0], [144, 0, 0], [145, 0, 1], [146, 0, 1]]
    }, 
    {
      "op": "Activation", 
      "name": "stage4_unit2_relu1", 
      "attrs": {"act_type": "relu"}, 
      "inputs": [[147, 0, 0]]
    }, 
    {
      "op": "null", 
      "name": "stage4_unit2_conv1_weight", 
      "attrs": {
        "kernel": "(3, 3)", 
        "no_bias": "True", 
        "num_filter": "512", 
        "pad": "(1, 1)", 
        "stride": "(1, 1)", 
        "workspace": "512"
      }, 
      "inputs": []
    }, 
    {
      "op": "Convolution", 
      "name": "stage4_unit2_conv1", 
      "attrs": {
        "kernel": "(3, 3)", 
        "no_bias": "True", 
        "num_filter": "512", 
        "pad": "(1, 1)", 
        "stride": "(1, 1)", 
        "workspace": "512"
      }, 
      "inputs": [[148, 0, 0], [149, 0, 0]]
    }, 
    {
      "op": "null", 
      "name": "stage4_unit2_bn2_gamma", 
      "attrs": {
        "eps": "1e-05", 
        "fix_gamma": "False", 
        "momentum": "0.9"
      }, 
      "inputs": []
    }, 
    {
      "op": "null", 
      "name": "stage4_unit2_bn2_beta", 
      "attrs": {
        "eps": "1e-05", 
        "fix_gamma": "False", 
        "momentum": "0.9"
      }, 
      "inputs": []
    }, 
    {
      "op": "null", 
      "name": "stage4_unit2_bn2_moving_mean", 
      "attrs": {
        "__init__": "[\"zero\", {}]", 
        "eps": "1e-05", 
        "fix_gamma": "False", 
        "momentum": "0.9"
      }, 
      "inputs": []
    }, 
    {
      "op": "null", 
      "name": "stage4_unit2_bn2_moving_var", 
      "attrs": {
        "__init__": "[\"one\", {}]", 
        "eps": "1e-05", 
        "fix_gamma": "False", 
        "momentum": "0.9"
      }, 
      "inputs": []
    }, 
    {
      "op": "BatchNorm", 
      "name": "stage4_unit2_bn2", 
      "attrs": {
        "eps": "1e-05", 
        "fix_gamma": "False", 
        "momentum": "0.9"
      }, 
      "inputs": [[150, 0, 0], [151, 0, 0], [152, 0, 0], [153, 0, 1], [154, 0, 1]]
    }, 
    {
      "op": "Activation", 
      "name": "stage4_unit2_relu2", 
      "attrs": {"act_type": "relu"}, 
      "inputs": [[155, 0, 0]]
    }, 
    {
      "op": "null", 
      "name": "stage4_unit2_conv2_weight", 
      "attrs": {
        "kernel": "(3, 3)", 
        "no_bias": "True", 
        "num_filter": "512", 
        "pad": "(1, 1)", 
        "stride": "(1, 1)", 
        "workspace": "512"
      }, 
      "inputs": []
    }, 
    {
      "op": "Convolution", 
      "name": "stage4_unit2_conv2", 
      "attrs": {
        "kernel": "(3, 3)", 
        "no_bias": "True", 
        "num_filter": "512", 
        "pad": "(1, 1)", 
        "stride": "(1, 1)", 
        "workspace": "512"
      }, 
      "inputs": [[156, 0, 0], [157, 0, 0]]
    }, 
    {
      "op": "elemwise_add", 
      "name": "_plus7", 
      "inputs": [[158, 0, 0], [142, 0, 0]]
    }, 
    {
      "op": "null", 
      "name": "bn1_gamma", 
      "attrs": {
        "eps": "1e-05", 
        "fix_gamma": "False", 
        "momentum": "0.9"
      }, 
      "inputs": []
    }, 
    {
      "op": "null", 
      "name": "bn1_beta", 
      "attrs": {
        "eps": "1e-05", 
        "fix_gamma": "False", 
        "momentum": "0.9"
      }, 
      "inputs": []
    }, 
    {
      "op": "null", 
      "name": "bn1_moving_mean", 
      "attrs": {
        "__init__": "[\"zero\", {}]", 
        "eps": "1e-05", 
        "fix_gamma": "False", 
        "momentum": "0.9"
      }, 
      "inputs": []
    }, 
    {
      "op": "null", 
      "name": "bn1_moving_var", 
      "attrs": {
        "__init__": "[\"one\", {}]", 
        "eps": "1e-05", 
        "fix_gamma": "False", 
        "momentum": "0.9"
      }, 
      "inputs": []
    }, 
    {
      "op": "BatchNorm", 
      "name": "bn1", 
      "attrs": {
        "eps": "1e-05", 
        "fix_gamma": "False", 
        "momentum": "0.9"
      }, 
      "inputs": [[159, 0, 0], [160, 0, 0], [161, 0, 0], [162, 0, 1], [163, 0, 1]]
    }, 
    {
      "op": "Activation", 
      "name": "relu1", 
      "attrs": {"act_type": "relu"}, 
      "inputs": [[164, 0, 0]]
    }, 
    {
      "op": "Pooling", 
      "name": "pool1", 
      "attrs": {
        "global_pool": "True", 
        "kernel": "(7, 7)", 
        "pool_type": "avg"
      }, 
      "inputs": [[165, 0, 0]]
    }, 
    {
      "op": "Flatten", 
      "name": "flatten0", 
      "inputs": [[166, 0, 0]]
    }, 
    {
      "op": "null", 
      "name": "fc1_weight", 
      "attrs": {"num_hidden": "1000"}, 
      "inputs": []
    }, 
    {
      "op": "null", 
      "name": "fc1_bias", 
      "attrs": {"num_hidden": "1000"}, 
      "inputs": []
    }, 
    {
      "op": "FullyConnected", 
      "name": "fc1", 
      "attrs": {"num_hidden": "1000"}, 
      "inputs": [[167, 0, 0], [168, 0, 0], [169, 0, 0]]
    }, 
    {
      "op": "null", 
      "name": "softmax_label", 
      "inputs": []
    }, 
    {
      "op": "SoftmaxOutput", 
      "name": "softmax", 
      "inputs": [[170, 0, 0], [171, 0, 0]]
    }
  ], 
  "arg_nodes": [
    0, 
    2, 
    3, 
    4, 
    5, 
    7, 
    9, 
    10, 
    11, 
    12, 
    16, 
    17, 
    18, 
    19, 
    22, 
    24, 
    25, 
    26, 
    27, 
    30, 
    32, 
    35, 
    36, 
    37, 
    38, 
    41, 
    43, 
    44, 
    45, 
    46, 
    49, 
    52, 
    53, 
    54, 
    55, 
    58, 
    60, 
    61, 
    62, 
    63, 
    66, 
    68, 
    71, 
    72, 
    73, 
    74, 
    77, 
    79, 
    80, 
    81, 
    82, 
    85, 
    88, 
    89, 
    90, 
    91, 
    94, 
    96, 
    97, 
    98, 
    99, 
    102, 
    104, 
    107, 
    108, 
    109, 
    110, 
    113, 
    115, 
    116, 
    117, 
    118, 
    121, 
    124, 
    125, 
    126, 
    127, 
    130, 
    132, 
    133, 
    134, 
    135, 
    138, 
    140, 
    143, 
    144, 
    145, 
    146, 
    149, 
    151, 
    152, 
    153, 
    154, 
    157, 
    160, 
    161, 
    162, 
    163, 
    168, 
    169, 
    171
  ], 
  "node_row_ptr": [
    0, 
    1, 
    2, 
    3, 
    4, 
    5, 
    6, 
    9, 
    10, 
    11, 
    12, 
    13, 
    14, 
    15, 
    18, 
    19, 
    20, 
    21, 
    22, 
    23, 
    24, 
    27, 
    28, 
    29, 
    30, 
    31, 
    32, 
    33, 
    34, 
    37, 
    38, 
    39, 
    40, 
    41, 
    42, 
    43, 
    44, 
    45, 
    46, 
    47, 
    50, 
    51, 
    52, 
    53, 
    54, 
    55, 
    56, 
    57, 
    60, 
    61, 
    62, 
    63, 
    64, 
    65, 
    66, 
    67, 
    68, 
    71, 
    72, 
    73, 
    74, 
    75, 
    76, 
    77, 
    78, 
    81, 
    82, 
    83, 
    84, 
    85, 
    86, 
    87, 
    88, 
    89, 
    90, 
    91, 
    94, 
    95, 
    96, 
    97, 
    98, 
    99, 
    100, 
    101, 
    104, 
    105, 
    106, 
    107, 
    108, 
    109, 
    110, 
    111, 
    112, 
    115, 
    116, 
    117, 
    118, 
    119, 
    120, 
    121, 
    122, 
    125, 
    126, 
    127, 
    128, 
    129, 
    130, 
    131, 
    132, 
    133, 
    134, 
    135, 
    138, 
    139, 
    140, 
    141, 
    142, 
    143, 
    144, 
    145, 
    148, 
    149, 
    150, 
    151, 
    152, 
    153, 
    154, 
    155, 
    156, 
    159, 
    160, 
    161, 
    162, 
    163, 
    164, 
    165, 
    166, 
    169, 
    170, 
    171, 
    172, 
    173, 
    174, 
    175, 
    176, 
    177, 
    178, 
    179, 
    182, 
    183, 
    184, 
    185, 
    186, 
    187, 
    188, 
    189, 
    192, 
    193, 
    194, 
    195, 
    196, 
    197, 
    198, 
    199, 
    200, 
    203, 
    204, 
    205, 
    206, 
    207, 
    208, 
    209, 
    210, 
    211
  ], 
  "heads": [[172, 0, 0]], 
  "attrs": {"mxnet_version": ["int", 10500]}
}